Enums/ИА_ПериодыДетализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ПериодыДетализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_ВидыАналитикиСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ВидыАналитикиСтатистики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАналитики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАналитикиПолный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_ВидыСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ВидыСтатистик</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПеревернутаяСтатистика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПолученияДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОтображаетСостояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИтогов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидыИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИтоговЗаОдинПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидыИтоговЗаОдинПериод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогПроизвольноеВыражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКуб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКуба</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_НомерКуба</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеПериод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеКоличество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_ХранилищеЗапросаКонструктора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЛинии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбораХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабПараметровЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапросаИтоговый</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйСписок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ПроверочныйСписок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляРасшифровки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ПоляРасшифровки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеРегистры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатистикиФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/КСУ_API_WEB_Statistics/Ext/Module.bsl
// вход id вида аналитики 
// выход id, value - значения аналитики
Функция GetDataOfAnalyticsGetData(Запрос)
	идАн = Запрос.ПараметрыURL["id"];
	ан = Справочники.ИА_ВидыАналитикиСтатистики.НайтиПоРеквизиту("ВебУИД",идАн);
	
	Если ан.Пустая() ТОгда
		Ответ = Новый HTTPСервисОтвет(400,"No such analytics");					
		Возврат Ответ;
	КонецЕсли;
	
	
	ЗначТип1 = ан.ТипАналитикиПолный;
	Если ЗначТип1 = "Булево" ИЛИ ЗначТип1 = "Строка" ИЛИ ЗначТип1 = "Число" ИЛИ ЗначТип1 = "Дата" тогда 
		Ответ = Новый HTTPСервисОтвет(400,"Primitive type");					
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		ЗначТип1 = СтрЗаменить(ЗначТип1, "СправочникСсылка", "Справочник");
		ЗначТип1 = СтрЗаменить(ЗначТип1, "ДокументСсылка", "Документ");
		ЗначТип1 = СтрЗаменить(ЗначТип1, "ПеречислениеСсылка", "Перечисление");  
		ЗначТип1 = СтрЗаменить(ЗначТип1, "ЗадачаСсылка", "Задача");
		
		ЭтоПеречисл = Найти(ЗначТип1,"Перечисление.")>0;
		
		Запрос = новый запрос;
		Если ЗначТип1 = "" Тогда 		
			Запрос.Текст = "ВЫБРАТЬ
			               |	ИА_ЗначениеАналитики.Ссылка
			               |ИЗ
			               |	Справочник.ИА_ЗначениеАналитики КАК ИА_ЗначениеАналитики
			               |ГДЕ
			               |	ИА_ЗначениеАналитики.Владелец = &Владелец
			               |	И ИА_ЗначениеАналитики.ПометкаУдаления = ложь";
			Запрос.УстановитьПараметр("Владелец", ан);
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
			               |	ИА_ЗначениеАналитики.Ссылка
			               |ИЗ
			               |	Справочник.ИА_ЗначениеАналитики КАК ИА_ЗначениеАналитики
			               |ГДЕ
			               |	ИА_ЗначениеАналитики.ПометкаУдаления = ложь";
			запрос.Текст = СтрЗаменить(запрос.Текст,"Справочник.ИА_ЗначениеАналитики", ЗначТип1);
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();

		МассивРез = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Если ЭтоПеречисл тогда    
				идЗн = КСУ_СтатистикиВеб.ПолучитьИмяЗначенияПеречисления(Выборка.ссылка);
				МассивРез.Добавить(Новый Структура("id, value", идЗн, идЗн));      
			Иначе
				МассивРез.Добавить(Новый Структура("id, value", строка(Выборка.ссылка.УникальныйИдентификатор()), строка(Выборка.ссылка)));      
			КонецЕсли;
		КонецЦикла;

		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();	
		ЗаписатьJSON(ЗаписьJSON, МассивРез);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			
		Ответ = Новый HTTPСервисОтвет(200);	
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);		
		Возврат Ответ;
	Исключение
		Ответ = Новый HTTPСервисОтвет(400,строка(ОписаниеОшибки()));					
		Возврат Ответ;
	КонецПопытки;
КонецФункции

// вход id статистики, дата начала, конца, значения аналитик
// выход  период, кол-во (значение статистики), комментарий и значение Аналитики 1,значение Аналитики 2,значение Аналитики 3
Функция GetStatisticsDataGetData(Запрос)
	идСтат = Запрос.ПараметрыURL["statisticId"];
	ДатаНачалаСтр = Запрос.ПараметрыURL["StartDate"];
	ДатаКонцаСтр = Запрос.ПараметрыURL["EndDate"];	
	ТипПериодаСтр = строка(Запрос.ПараметрыURL["periodType"]); // по дням/неделям/месяцам/годам 10, 20, 30, 40
	
	ан1 = Запрос.ПараметрыЗапроса.Получить("anValue1");
	ан2 = Запрос.ПараметрыЗапроса.Получить("anValue2");
	ан3 = Запрос.ПараметрыЗапроса.Получить("anValue3");
	
	ВидСтат = Справочники.ИА_ВидыСтатистик.НайтиПоРеквизиту("ВебУИД",идСтат);
	Если ВидСтат.Пустая() ТОгда
		Ответ = Новый HTTPСервисОтвет(400,"No such statistic");					
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
	    ДатаНачала = МестноеВремя(дата(ДатаНачалаСтр));
		ДатаКонца = КонецДня(МестноеВремя(дата(ДатаКонцаСтр)));
		
		ЗначАн1 = КСУ_СтатистикиВеб.получитьЗначениеАналитики(ВидСтат, 1, ан1);
		ЗначАн2 = КСУ_СтатистикиВеб.получитьЗначениеАналитики(ВидСтат, 2, ан2);
		ЗначАн3 = КСУ_СтатистикиВеб.получитьЗначениеАналитики(ВидСтат, 3, ан3);		
		
		Если ТипПериодаСтр = "10"  или ТипПериодаСтр = "20" Тогда // день или неделя
			ТипПериода = Перечисления.ИА_ПериодыДетализации.День;
		ИначеЕсли ТипПериодаСтр = "30" Тогда
			ТипПериода = Перечисления.ИА_ПериодыДетализации.Месяц;
		ИначеЕсли ТипПериодаСтр = "40" Тогда
			ТипПериода = Перечисления.ИА_ПериодыДетализации.Год;
		КонецЕсли;
		тз = КСУ_СтатистикиВеб.ПолучитьДанныеСтатистики(ДатаНачала, ДатаКонца, ТипПериода, ВидСтат, ЗначАн1, ЗначАн2, ЗначАн3); 
		
		МассивРез = Новый Массив;
		для каждого стр из тз Цикл
			UTC = УниверсальноеВремя(стр.Период);
			прАн1 = КСУ_СтатистикиВеб.получитьИДЗначенияАналитики(ВидСтат, 1, стр.Аналитика1);
			прАн2 = КСУ_СтатистикиВеб.получитьИДЗначенияАналитики(ВидСтат, 2, стр.Аналитика2);
			прАн3 = КСУ_СтатистикиВеб.получитьИДЗначенияАналитики(ВидСтат, 3, стр.Аналитика3);
			МассивРез.Добавить(Новый Структура("date, value, analitics1, analitics2, analitics3", формат(UTC,"ДФ=yyyy-MM-ddTHH:mm:ss.000Z"), формат(стр.Количество,"ЧН=; ЧГ="),прАн1,прАн2,прАн3 ));     
		КонецЦикла;

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();	
		ЗаписатьJSON(ЗаписьJSON, МассивРез);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			
		Ответ = Новый HTTPСервисОтвет(200);	
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);		
		Возврат Ответ;
	Исключение
		
		Ответ = Новый HTTPСервисОтвет(400,строка(ОписаниеОшибки()));					
		Возврат Ответ;
	КонецПопытки;
КонецФункции
